# Дано коло з центром на початку координат та радіусом 4.
# Користувач вводить з клавіатури координати точки x та y.
# Написати програму, яка визначить, лежить ця точка всередині кола чи ні.

R = 4
A = 0
B = 0
x = int(input("Введіть коодинати точки х: "))
y = int(input("Введіть коодинати точки y: "))
res = "Так, ця точка лежить всередині кола" if (x-A)**2+(y-B)**2 < R**2 else "Ні, не лежить."
print(res)
